In [ ]:
%var SystemName=Vantage

Password is **TRNG_TDU_TD01** Enter in Password dialog box then hit enter/return key to connect

In [ ]:
%connect ${SystemName}

---------------------------------------------------------------------
-- Teradata Vantage Analytics Workshop   --
-- Module 02 - Attribution             --

In [ ]:
-------------------------------------------
--Lab 06a: WindowSize(Rows) --
------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib7;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 8 rows Uniformly prior to Buy
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib7
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:8')
) AS dt ORDER BY id, ts;

In [ ]:
-- Lab 06b: WindowSize(Seconds) --
------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib7;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score rows 17 seconds Uniformly prior to Conversion = Buy
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib7
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('SECONDS:17')
) AS dt ORDER BY id, ts;

.

In [ ]:
---------------------------------------------------------
-- Lab 06c: WindowSize(Rows&Seconds) --
---------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('buyonline');
INSERT into conversion_event_table (conversion_events) values ('buyinstore');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.borre_xx;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score rows on fewest rows between Rows and Seconds
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.borre_xx
 PARTITION BY user_id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4&SECONDS:5')
) AS dt ORDER BY user_id, ts;

In [ ]:
----------------------------------------------
-- Lab 08: Model Type = SIMPLE --
----------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows Uniformly prior to Conversion = Purchase
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
------------------------------------------------------------
-- Lab 09: Model Type = EVENT_REGULAR --
------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'EVENT_REGULAR');
INSERT into model_table (id, model) values (1, 'Email:1.0:UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score up to 4 "Email" rows Uniformly prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
------------------------------------------------------------
-- Lab 10: Model Type = SEGMENT_ROWS --
------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SEGMENT_ROWS');
INSERT into model_table (id, model) values (1, '2:0.70:UNIFORM:NA');
INSERT into model_table (id, model) values (2, '2:0.30:UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows via SEGMENT_ROWS prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
-----------------------------------------------------------------
-- Lab 11: Model Type = SEGMENT_SECONDS --
-----------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SEGMENT_SECONDS');
INSERT into model_table (id, model) values (1, '5:0.70:UNIFORM:NA');
INSERT into model_table (id, model) values (2, '7:0.30:UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows via SEGMENT_SECONDS prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('SECONDS:12')
) AS dt ORDER BY id, ts;

In [ ]:
-------------------------------------------------------
-- Lab 12: Model Values = LAST_CLICK --
-------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SEGMENT_ROWS');
INSERT into model_table (id, model) values (1, '4:1.0:LAST_CLICK:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows using LAST_CLICK prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
--------------------------------------------------------
-- Lab 13: Model Values = FIRST_CLICK --
--------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'FIRST_CLICK:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows using FIRST_CLICK prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
---------------------------------------------------
-- Lab 14: Model Values = UNIFORM --      
---------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows using UNIFORM prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
---------------------------------------------------------
-- Lab 15: Model Values = EXPONENTIAL --          
---------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'EXPONENTIAL:0.5,ROW');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows using EXPONENTIAL prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
)  AS dt ORDER BY id, ts;

In [ ]:
-----------------------------------------------------
-- Lab 16: Model Values = WEIGHTED --
-----------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'WEIGHTED:0.5, 0.3, 0.1, 0.1');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib9 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows using WEIGHTED prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib9
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:4')
) AS dt ORDER BY id, ts;

In [ ]:
----------------------------------------------------------------
-- Lab 17: WindowSize Exceeds Available Data --
----------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Conversion');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.attrib1 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Score 4 rows prior to Conversion
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib1
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:5')
) AS dt ORDER BY id, ts;

In [ ]:
------------------------------------
-- Lab 18: ExcludeEvents --
------------------------------------

----------------------------------------------------------------
-- Lab 18a: Without ExcludeEvents argument    --
-- Notice have 'TV' and 'PrintAd' rows in Output --
----------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('Buy');

INSERT into model_table (id, model) values (0, 'SIMPLE');
INSERT into model_table (id, model) values (1, 'UNIFORM:NA');

In [ ]:
-- Create Exclude Event Table and Populate
DROP TABLE excluding_event_table;

In [ ]:
CREATE MULTISET TABLE excluding_event_table (excluding_events varchar (255));

In [ ]:
INSERT into excluding_event_table (excluding_events) values ('TV');
INSERT into excluding_event_table (excluding_events) values ('PrintAd');

In [ ]:
-- View all 4 tables
SELECT * FROM TRNG_TDU_TD01.attrib7 ORDER BY ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;
SELECT * FROM excluding_event_table;

In [ ]:
-- Without ExcludeEvents argument 
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib7
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 -- ON excluding_event_table AS ExcludedEventTable DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:10')
) AS dt ORDER BY id, ts;

In [ ]:
------------------------------------------------------------------------
-- Lab 18b (With ExcludeEvents argument)                 --
-- Notice 'TV' and 'PrintAd' rows removed from Output --
------------------------------------------------------------------------
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.attrib7
 PARTITION BY id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON excluding_event_table AS ExcludedEventTable DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('ROWS:10')
) AS dt ORDER BY id, ts;

In [ ]:
--------------------------------------------------------------
-- Lab 20                                                          --
-- Combining Multiple Model Values Together --
--------------------------------------------------------------
-- Create Conversion Table and Populate
DROP TABLE conversion_event_table;

In [ ]:
DROP TABLE model_table;

In [ ]:
CREATE MULTISET TABLE conversion_event_table (conversion_events varchar (255));

In [ ]:
CREATE MULTISET TABLE model_table (id integer, model varchar (255));

In [ ]:
INSERT into conversion_event_table (conversion_events) values ('buy');

INSERT into model_table (id, model) values (0, 'SEGMENT_ROWS');
INSERT into model_table (id, model) values (1, '3:0.4:UNIFORM:NA');
INSERT into model_table (id, model) values (2, '3:0.3:LAST_CLICK:NA');
INSERT into model_table (id, model) values (3, '3:0.2:EXPONENTIAL:0.5,ROW');
INSERT into model_table (id, model) values (4, '3:0.1:FIRST_CLICK:NA');

In [ ]:
-- View all 3 tables
SELECT * FROM TRNG_TDU_TD01.borre_y ORDER BY user_id, ts;
SELECT * FROM conversion_event_table;
SELECT * FROM model_table ORDER BY id;

In [ ]:
-- Run multiple model values
SELECT * FROM Attribution 
(ON TRNG_TDU_TD01.borre_y
 PARTITION BY user_id 
 ORDER BY ts
 ON conversion_event_table AS conversion DIMENSION
 ON model_table AS model1 DIMENSION
 USING
 EventColumn ('event')
 TimestampColumn ('ts')
 WindowSize ('rows:12')
) AS dt ORDER BY user_id, ts;

#### Disconnect from Vantage

In [ ]:
%disconnect ${SystemName}

Copyright 2021 Teradata. All rights reserved.